unload/cf/DataProcessors/кб99_АРМСписание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>кб99_АРМСписание</Name>
			<Comment>Списание товаров по реализациям через ВСД2_Инвентаризация</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Реализации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отметка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Реализация</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проведен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

unload/cf/AccumulationRegisters/кб99_ОстаткиПартийВСД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>кб99_ОстаткиПартийВСД</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Продукция_Элемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Продукция_Элемент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВСД_Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Площадка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

unload/cf/Documents/РеализацияТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>РеализацияТоваровУслуг</Name>
			<Comment>(Общ)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузополучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВСДНеВыписываем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

unload/cf/DataProcessors/кб99_АРМСписание/Forms/Форма/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// АРМ Списание товаров через ВСД2_Инвентаризация
//

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Устанавливаем начальные значения периода - текущий месяц
	Объект.ДатаНачала = НачалоМесяца(ТекущаяДата());
	Объект.ДатаОкончания = КонецМесяца(ТекущаяДата());

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьСписокРеализаций(Команда)

	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Сообщить("Не указана организация!");
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		Сообщить("Не указана дата начала периода!");
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		Сообщить("Не указана дата окончания периода!");
		Возврат;
	КонецЕсли;

	ЗаполнитьСписокРеализацийНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)

	Для Каждого Строка Из Объект.Реализации Цикл
		Строка.Отметка = Истина;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)

	Для Каждого Строка Из Объект.Реализации Цикл
		Строка.Отметка = Ложь;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументыСписания(Команда)

	КоличествоОтмеченных = 0;
	Для Каждого Строка Из Объект.Реализации Цикл
		Если Строка.Отметка Тогда
			КоличествоОтмеченных = КоличествоОтмеченных + 1;
		КонецЕсли;
	КонецЦикла;

	Если КоличествоОтмеченных = 0 Тогда
		Сообщить("Не выбрано ни одного документа для списания!");
		Возврат;
	КонецЕсли;

	СоздатьДокументыСписанияНаСервере();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокРеализацийНаСервере()

	Объект.Реализации.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Реализация,
	|	РеализацияТоваровУслуг.Дата КАК Дата,
	|	РеализацияТоваровУслуг.Номер КАК Номер,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	РеализацияТоваровУслуг.Склад КАК Склад,
	|	РеализацияТоваровУслуг.Проведен КАК Проведен
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И РеализацияТоваровУслуг.ВСДНеВыписываем = ИСТИНА
	|	И РеализацияТоваровУслуг.Организация = &Организация
	|	И РеализацияТоваровУслуг.Проведен = ИСТИНА
	|	И НЕ РеализацияТоваровУслуг.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";

	Запрос.УстановитьПараметр("ДатаНачала", Объект.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.ДатаОкончания));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);

	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		Сообщить("За указанный период не найдено документов реализации с признаком 'ВСД не выписываем'");
		Возврат;
	КонецЕсли;

	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Реализации.Добавить();
		НоваяСтрока.Отметка = Ложь;
		НоваяСтрока.Реализация = Выборка.Реализация;
		НоваяСтрока.Дата = Выборка.Дата;
		НоваяСтрока.Номер = Выборка.Номер;
		НоваяСтрока.Контрагент = Выборка.Контрагент;
		НоваяСтрока.Склад = Выборка.Склад;
		НоваяСтрока.Проведен = Выборка.Проведен;
	КонецЦикла;

	Сообщить("Найдено документов: " + Объект.Реализации.Количество());

КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыСписанияНаСервере()

	// Проверка отмеченных строк
	ОтмеченныеСтроки = Новый Массив;
	Для Каждого СтрокаРеализации Из Объект.Реализации Цикл
		Если СтрокаРеализации.Отметка Тогда
			ОтмеченныеСтроки.Добавить(СтрокаРеализации);
		КонецЕсли;
	КонецЦикла;

	Если ОтмеченныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	// Получение параметров организации
	ПараметрыОрганизации = кб99_ВСД.ЗагрузитьПараметры(Объект.Организация);

	// Получение хозсубъекта
	ХозСубъект = кб99_ВСД.НайтиХозСубъект(Объект.Организация);
	Если НЕ ЗначениеЗаполнено(ХозСубъект) Тогда
		Сообщить("Не найден хозяйствующий субъект для организации " + Объект.Организация + "!");
		Возврат;
	КонецЕсли;

	// Для каждой отмеченной реализации создаем свой документ инвентаризации
	СозданныеДокументы = Новый Массив;
	ДокументыСОшибками = Новый Массив;

	Для Каждого СтрокаРеализации Из ОтмеченныеСтроки Цикл

		Попытка

			// Получение склада из реализации
			Если НЕ ЗначениеЗаполнено(СтрокаРеализации.Склад) Тогда
				ДокументыСОшибками.Добавить(СтрокаРеализации.Реализация);
				Сообщить("Не указан склад в документе " + СтрокаРеализации.Реализация);
				Продолжить;
			КонецЕсли;

			// Поиск площадки по складу
			Площадка = кб99_ВСД.НайтиПлощадкуПоСкладу(СтрокаРеализации.Склад, ХозСубъект);
			Если НЕ ЗначениеЗаполнено(Площадка) Тогда
				ДокументыСОшибками.Добавить(СтрокаРеализации.Реализация);
				Сообщить("Не найдена площадка ВСД для склада: " + СтрокаРеализации.Склад);
				Продолжить;
			КонецЕсли;

			// Создание документа ВСД2_Инвентаризация
			ДокВСД = Документы.ВСД2_Инвентаризация.СоздатьДокумент();

			ДокВСД.Дата = ТекущаяДата();
			ДокВСД.Организация = Объект.Организация;
			ДокВСД.Владелец_ХозСубъект = ХозСубъект;
			ДокВСД.Владелец_площадка = Площадка;
			ДокВСД.ДокументОснование = СтрокаРеализации.Реализация;
			ДокВСД.ПричинаРасхождения = "Списание по реализации без ВСД";
			ДокВСД.ОписаниеНесоответствия = "Списание товаров по документу " +
			                                 СтрокаРеализации.Реализация +
			                                 " от " + Формат(СтрокаРеализации.Дата, "ДФ=dd.MM.yyyy");

			// Заполнение табличной части из реализации
			ЗаполнитьПродукциюИзРеализации(ДокВСД, СтрокаРеализации.Реализация, Площадка);

			Если ДокВСД.Продукция.Количество() > 0 Тогда
				ДокВСД.Записать();
				СозданныеДокументы.Добавить(ДокВСД.Ссылка);
				Сообщить("Создан документ: " + ДокВСД.Ссылка);
			Иначе
				ДокументыСОшибками.Добавить(СтрокаРеализации.Реализация);
				Сообщить("Не заполнена продукция для " + СтрокаРеализации.Реализация + ". Возможно номенклатура не связана с продукцией ВСД.");
			КонецЕсли;

		Исключение
			ДокументыСОшибками.Добавить(СтрокаРеализации.Реализация);
			Сообщить("Ошибка создания документа для " + СтрокаРеализации.Реализация + ": " +
			         ОписаниеОшибки());
		КонецПопытки;

	КонецЦикла;

	// Вывод итоговой информации
	Если СозданныеДокументы.Количество() > 0 Тогда
		Сообщить("Успешно создано документов списания: " + СозданныеДокументы.Количество());
	КонецЕсли;

	Если ДокументыСОшибками.Количество() > 0 Тогда
		Сообщить("Документов с ошибками: " + ДокументыСОшибками.Количество());
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПродукциюИзРеализации(ДокВСД, ДокРеализация, Площадка)

	// Получение товаров из реализации
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТовары.Номенклатура КАК Номенклатура,
	|	РеализацияТовары.Количество КАК Количество,
	|	РеализацияТовары.Серия КАК Серия
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТовары
	|ГДЕ
	|	РеализацияТовары.Ссылка = &Реализация
	|	И РеализацияТовары.Количество > 0";

	Запрос.УстановитьПараметр("Реализация", ДокРеализация);

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	Пока Выборка.Следующий() Цикл

		// Поиск элемента продукции по номенклатуре
		ПродукцияЭлемент = кб99_ВСД.Продукция_Элемент_ПолучитьПоНоменклатуре(Выборка.Номенклатура);

		Если НЕ ЗначениеЗаполнено(ПродукцияЭлемент) Тогда
			Продолжить; // Пропускаем номенклатуру без связи с ВСД
		КонецЕсли;

		// Поиск активных партий на площадке
		ПартииНаСкладе = НайтиПартииДляСписания(ПродукцияЭлемент, Площадка, Выборка.Количество);

		Если ПартииНаСкладе.Количество() = 0 Тогда
			// Если партий нет, создаем строку без партии (будет создана новая партия при погашении)
			НоваяСтрока = ДокВСД.Продукция.Добавить();
			НоваяСтрока.Продукция_Элемент = ПродукцияЭлемент;
			НоваяСтрока.Количество = Выборка.Количество;
			НоваяСтрока.КоличествоДоИзменения = 0;

			// Заполнение остальных реквизитов из элемента продукции
			НоваяСтрока.Продукция = ПродукцияЭлемент.Продукция;
			НоваяСтрока.ВидПродукции = ПродукцияЭлемент.ВидПродукции;
			НоваяСтрока.ЕдиницаИзмерения = ПродукцияЭлемент.ЕдиницаИзмерения;
			НоваяСтрока.НаименованиеПродукции = ПродукцияЭлемент.Наименование;
			НоваяСтрока.Производитель_площадка = Площадка;
			НоваяСтрока.Производитель_Страна = Площадка.Страна;
		Иначе
			// Списываем из найденных партий
			Для Каждого ПартияДанные Из ПартииНаСкладе Цикл

				НоваяСтрока = ДокВСД.Продукция.Добавить();
				НоваяСтрока.Партия = ПартияДанные.Партия;
				НоваяСтрока.Продукция_Элемент = ПродукцияЭлемент;
				НоваяСтрока.Количество = 0; // Списываем полностью - указываем 0
				НоваяСтрока.КоличествоДоИзменения = ПартияДанные.ТекущееКоличество;

				// Заполнение остальных реквизитов из элемента продукции
				НоваяСтрока.Продукция = ПродукцияЭлемент.Продукция;
				НоваяСтрока.ВидПродукции = ПродукцияЭлемент.ВидПродукции;
				НоваяСтрока.ЕдиницаИзмерения = ПродукцияЭлемент.ЕдиницаИзмерения;
				НоваяСтрока.НаименованиеПродукции = ПродукцияЭлемент.Наименование;

				// Даты из партии
				Если ЗначениеЗаполнено(ПартияДанные.Партия) Тогда
					НоваяСтрока.ДатаИзготовления1 = кб99_ВСД_Запросы.СтрокаВДатаВремя(ПартияДанные.Партия.ДатаИзготовления1);
					НоваяСтрока.ДатаСрокГодности1 = кб99_ВСД_Запросы.СтрокаВДатаВремя(ПартияДанные.Партия.ДатаСрокГодности1);
					НоваяСтрока.Производитель_площадка = ПартияДанные.Партия.Производитель_Площадка;
				Иначе
					НоваяСтрока.Производитель_площадка = Площадка;
				КонецЕсли;

				НоваяСтрока.Производитель_Страна = НоваяСтрока.Производитель_площадка.Страна;

			КонецЦикла;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция НайтиПартииДляСписания(ПродукцияЭлемент, Площадка, КоличествоКСписанию)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОстаткиПартийОстатки.Партия КАК Партия,
	|	ОстаткиПартийОстатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.кб99_ОстаткиПартийВСД.Остатки(
	|		&МоментВремени,
	|		Продукция_Элемент = &ПродукцияЭлемент
	|			И Площадка = &Площадка) КАК ОстаткиПартийОстатки
	|ГДЕ
	|	ОстаткиПартийОстатки.КоличествоОстаток > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОстаткиПартийОстатки.Партия.ДатаСрокГодности1";

	Запрос.УстановитьПараметр("МоментВремени", ТекущаяДата());
	Запрос.УстановитьПараметр("ПродукцияЭлемент", ПродукцияЭлемент);
	Запрос.УстановитьПараметр("Площадка", Площадка);

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	МассивПартий = Новый Массив;
	ОстатокКСписанию = КоличествоКСписанию;

	Пока Выборка.Следующий() И ОстатокКСписанию > 0 Цикл

		КоличествоИзПартии = Мин(Выборка.Количество, ОстатокКСписанию);

		ПартияДанные = Новый Структура;
		ПартияДанные.Вставить("Партия", Выборка.Партия);
		ПартияДанные.Вставить("ТекущееКоличество", Выборка.Количество);
		ПартияДанные.Вставить("КоличествоСписания", КоличествоИзПартии);

		МассивПартий.Добавить(ПартияДанные);

		ОстатокКСписанию = ОстатокКСписанию - КоличествоИзПартии;

	КонецЦикла;

	Возврат МассивПартий;

КонецФункции

#КонецОбласти
